{
  "groups": [
    {
      "g1": {
        "Верификация": "Тестирование реализации модели постановки задачи, построенной программистом.",
        "Четвертый закон Ципфа": "Длина слова обратно пропорциональна его частоте, что может быть проверен путем простого анализа списка служебных слов.",
        "Какими двумя методами можно измерять качество программного средства": "внутреннее (анализ метрик кода). внешнее (поведение кода при использовании)",
        "Программная инженерия. Определение,охват,цели": "Это приложение систематического, дисциплинированного, измеримого подхода к разработке, функционированию и сопровождению ПО. ПИ охватывает все жизвенные этапы ПО: 1.Анализ и сбор требований, 2.Проектирование, 3.Разработка, 4.Тестирование, 5.Сопровождение. Цель ПИ - создание ПО, которое соответствует требованиям заказчиков, обладает надежностью, эффективностью и масштабируемостью, а так же является легко сопровождаемой и модифицируемой.",
        "Оценка качества ПО": "Совокупность операций, включающий выбор показателей качества определенных значений и сравнения их с базовыми значениями.",
        "Метрика ПО": "Это мера, позволяющая получить численное значение некоторого свойства ПО или его спецификации",
        "Закон Бенфорда": "В 30% первая цифра - 1. P(d)=log(1+1/d)",
        "Второй закон Ципфа": "...",
        "Классификация метрик ПО": "1. По длинне ПО (по кол-ву строк(LOC,SLOC), по кол-ву функциональностей, по кол-ву файлов). 2. По структуре ПО (по потоку управления, по потоку данных, по модульности)",
        "Закон Хипса": "Казалось бы, словарь уникальных слов должен насыщаться, а его объем стабилизироваться при увеличеснии объемов текста. Оказывается, что нет: v(n)=a*n^b, v-объем словаря уникальных слов из n слов, a,b - эмпирические параметры.",
        "Аттестация": "Это авторитетное подтверждение качества ПО по общепринятой официальной процедуре.",
        "Качество ПО": "Это совокупность свойств, характерезующих способность ПО удовлетворять потребностям пользователя в соответствии с предназначением.",
        "Мера сложности произвольной последовательности символов": "Мера сложности произвольной последовательности символов некоторого фиксированного алфавита называется длина(кол-во двоичных разрядов) самой короткой программы, генерирующую эту последовательность.",
        "(Интеллектуальная) информационная система": "Это автоматизированная система, обеспечивающая поддержку в виде вычислительной, коммуникационной, технической, программной, лингвистической и ресурсной над динамической информационной моделью некоторой предметной области для удовлетворения (интеллектуальных) информационных потребностей пользователей.",
        "Метрики, которые рекомендует применять стандарт": "внутреннее качество (разработка). внешнее качество (заказчик). качество при использовании в процессе эксплуатации",
        "Первый закон Ципфа": "Если для некоторого достаточно большого текста составить список всех слов, которые в нем встречались, а затем ранжировать эти слова в порядке убывания частоты их появления в тексте, то для любого слова произведение его ранга(номера)r и частотой появления f будет постоянной величиной f. C=f*r",
        "Закон Парето. Принцип 80/20": "80% работы приносят лишь 20% успеха и наоборот.",
        "Гармонический ряд": "1+1/2+1/3+1/4+1/5+...+1/n",
        "Сертификация": "Процедура подтверждающая соответствия, посредством которой независимая от изготовителя и потребления организация удовлетворяет в письменной форме, что продукция соответствует установленным требованиям",
        "Критерий качества": "Это понятие, признак или численный показатель, характерезующий оцениваемый фактор качества.",
        "Характеристики алгоритмов сжатия данных": "1. Коэффицент сжатия R, характирезующий отношения исходных данных Lи к объему сжатых данных Lс R=Lи/Lс. 2. Степень сжатия r, характерезующая относительное уменьшение объема данных r=((Lи-Lс)/Lи)*100%. 3. Скорость сжатия: Vc = Lи/tс. 4. Скорость распоковки: Vр = Lи/tр. 5. Симметричность во времени C-это отношение С=tс/tр",
        "Интервальное кодирование (Range Coding)": "Выписываем кодируемую строку. Составляем словарь, который записываем перед кодируемой строкой. Выписываем разницу в кол-вах букв между двумя одикаковыми. Минусы: двхзначность разрядов, расстояние может быть очень велико, не хранится алфавит.",
        "Метод сжатия 'Стопкой книг'": "Выписуем алфавит. Выписывем номер буквы кодируемого слова, затем переставляем выписанную букву на первую позицию алфавита.",
        "Алгоритм RLE": "Выписываем пары в виде (кол-во символов, cимвол)",
        "Алгоритм LZ77": "...",
        "Алгоритм LZSS": "...",
        "Алгоритм LZ78": "...",
        "Алгоритм LZW": "...",
        "Лексический анализатор (сканер)": "Это та часть компилятора, которая разбивает входной текст на смысловые единицы (имена, константы, операторы и тд) и удаляет избыточные символы (пробелы, комментарии). Входом сканера является исходящая программа, а выходом - последовательность лексем, которую называют лексической сверткой программы и которая хранится в таблице лексем, вида (тип лексемы, данные о ней)",
        "Лексема": "Лексемами называют цепочку терминальных символов: ключевые (служебные) слова, числовые константы, идентификаторы, спец.знаки, разделители.",
        "Измеряемые свойства программ. По метрикам Холстеда": "Операторы и операнды. Операторы: имена арифметических и логических операций, присваивания, условные и безусловные переходы, разделители, скобки, имена процедур и функции, выражения типа if-else. Операнды: переменные и константы.",
        "Третий закон Ципфа": "Количество значений слова коррелирует с квадратным корнем его частоты. Нечастые слова более однозначны.",
        "Стандартизация": "Это способ управления качеством",
        "Закон Бредфорда": "Если журналы расположить в порядке убывания числа помещенных в них статьях, по полученный список можно разбить на три зоны так, чтобы кол-во статей было одинаковым. N1 - профильные журналы. N2 - журналы частично посвещенные теме. N3 - журналы отдаленные от темы. N3/N2=N2/N1=const."
      },
      "g2": {},
      "g3": {}
    }
  ]
}