
-------------------------------------
  f1 x | x<=0      = (abs x) - 10
       | otherwise = x*x + x + 1

  f2 x | (-35)<=x && x<=35 = x*x*x
       | otherwise         = abs x

  f3 x | x<=2      = abs (x+2)
       | otherwise = (x^3) -1

  f4 x | x>3       = abs (3-x)
       | otherwise = (x^3)+(x^2)

  f5 x | (-5)<=x && x<=5 = x*x-4
       | otherwise       = abs (2*x)

  f6 x | (-8)<=x && x<=8 = x^3 + x^2
       | otherwise = 1+ abs x

  f7 x | x>=127    = (-32000)-x
       | otherwise = abs (x^3)

  f8 x | x<(-128)  = abs (x^2+1)
       | otherwise = x^5
------------------------------------- 
  mx = 255     -- Переменные для теста.
  mn = (-255)  -- Если есть сомнения в честности.
  ze = 0       -- Вы вольны подобрать значения самостоятельно.

  t1 = f1 mx == 65281  &&
       f1 mn == 245    &&
       f1 ze == (-10) 

  t2 = f2 mx == 255 &&
       f2 mn == 255 &&
       f2 ze == 0  

  t3 = f3 mx == 16581374 &&
       f3 mn == 253      &&
       f3 ze == 2 

  t4 = f4 mx == 252         &&
       f4 mn == (-16516350) &&
       f4 ze == 0 

  t5 = f5 mx == 510 &&
       f5 mn == 510 &&
       f5 ze == (-4)

  t6 = f6 mx == 256 &&
       f6 mn == 256 &&
       f6 ze == 0 

  t7 = f7 mx == (-32255) &&
       f7 mn == 16581375 &&
       f7 ze == 0 

  t8 = f8 mx == 255^5 &&
       f8 mn == 65026 &&
       f8 ze == 0 

------------------------------------- 
  test = t1 && t2 && t3 && t4 && 
         t5 && t6 && t7 && t8
-------------------------------------
