   -- Демонстрация вычисления площади поверхности и объёма
   -- додекаэдра и икосаэдра, выраженные с помощью:
   --  (1) радиуса вписанной сферы r;
   --  (2) радиуса описанной сферы rEnter
   -- ***********************************
   -- Вычисления поверхностей и объёмов 
   -- для  о п и с а н н о й  сферы...
   ------------------------------------------------------
   sDodecahedron rEnter = 3 * sqrt (5 * (5 + 2 * sqrt 5))
                            * (4 * rEnter / sqrt 3 / (1+sqrt 5))^^2
   sicosahedron rEnter = 5 * sqrt 3.0 
                           * (4 * rEnter / sqrt (2.0 * (5 + sqrt 5)))^^2
   ---------------------------------------------------------------------
   vDodecahedron rEnter = (15 + 7 * sqrt 5) / 4
                            * (4 * rEnter / sqrt 3 / (1+sqrt 5))^^3
   vicosahedron rEnter = 5 * (3 + sqrt 5) / 12
                           * (4 * rEnter / sqrt (2.0 * (5 + sqrt 5)))^^3

   -- *********************************
   -- Вычисления поверхностей и объёмов 
   -- для  в п и с а н н о й  сферы...
   --------------------------------------------------
   sDodecahedron' r = 3 * sqrt (5 * (5 + 2 * sqrt 5))
                        * (20 * r / sqrt (10 * (25+11*sqrt 5)))^^2
   sicosahedron' r = 5 * sqrt 3.0 
                       * (12 * r / sqrt 3.0 / (3 + sqrt 5))^^2
   -----------------------------------------------------------
   vDodecahedron' r = (15 + 7 * sqrt 5) / 4
                          * (20 * r / sqrt (10 * (25+11*sqrt 5)))^^3
   vicosahedron' r = 5 * (3 + sqrt 5) / 12
                       * (12 * r / sqrt 3.0 / (3 + sqrt 5))^^3

   -- *********************
   -- Некоторые вычисления:
   ------------------------
   -- Решение задачи 1...
   --------------------------------------------------------
   test1 = (sDodecahedron 1, sicosahedron 1, 4 * pi * 1^^2)
   test2 = (vDodecahedron 1, vicosahedron 1, 4 / 3 * pi * 1^^3)
   ------------------------------------------------------------
   test3 = (sDodecahedron' 1, sicosahedron' 1, 4 * pi)
   test4 = (vDodecahedron' 1, vicosahedron' 1, 4 / 3 * pi)
   -------------------------------------------------------
   test5 = 3 * (15+7*sqrt 5) / (15+5*sqrt 5)
             * (5.0 * sqrt 3 / 3.0 / sqrt (25.0 + 10 * sqrt 5))**1.5

   ------------------------
   -- "Решение" задачи 2...
   -----------------------------------------
   test6 = ((2 * (5 + sqrt 5)) / 3 / sqrt 3, 
            (2 / 3.0 * sqrt (10+2*sqrt 5)),4 / 3 * pi * 1^^3)

   ------------------------
   -- "Решение" задачи 3...
   --------------------------------
   test7 = (sqrt (10+2*sqrt 5) / 4,        
            sqrt (10+2*sqrt 5) / 4)
   test8 = (sqrt 3 * (3+sqrt 5) / 12, 
            sqrt 6 * sqrt (7+3*sqrt 5) / 12)   -- * sqrt 5) / 6)
