   -- Решение одной из задач домашнего задания
   --
   -- [Ахо,Ульман,1978,с.345]
   -- ***********************
   d 1 = 1
   d n = 1 + d (n-1) * d (n-1)

   -----------------------------------------
   test1 n = floor $ 1.502837 ^^ (2 ^ (n-1))
   test2   = take 20 $ map (\x -> (x, abs (d x - test1 x)))
                           [1..11]
   -------------------------------
   {-
     Безуспешная попытка решить рекуррентное соотношение
     в системе символьных вычислений Maple:

     > rsolve({f(n) = 1 + f(n-1) * f(n-1), f(0)=1}, {f});
   -}
