   -- Демонстрация работы с комплексными числами
   -- с помощью библиотеки Complex.

   -- Автор: М.В.Швецкий (29.06.2014, 06:00-06:37) 
   -- ********************************************
   import Complex

   -- ********************************************
   -- Представление комплексных чисел в библиотеке
   -----------------------------------------------
   ch0 = 0 :+ 1
   ch1 = 1 :+ 2
   ch2 = 3 :+ 4
   ch3 = 1 :+ 1
   ch4 = 1 :+ (-0.5 * sqrt 2.0)
   ch5 = 1 :+ 100

   -- **********************************
   -- Операции над комплексными числами:
   ---------------------------------------------------
   -- (1) нахождение действительной части комплексного 
   --     числа
   --------------------
   test1 = realPart ch1
   -------------------------------------------------
   -- (2) нахождение мнимой части комплексного числа
   -------------------------------------------------
   test2 = imagPart ch1
   ------------------------------------
   -- (3) нахождение сопряжённого числа
   ------------------------------------
   test3 = conjugate ch1
   -------------------------------------------
   -- (4) нахождение модуля комплексного числа
   -------------------------------------------
   test4 = magnitude ch1
   ----------------------------------------------
   -- (5) вычисление аргумента комплексного числа
   ----------------------------------------------
   test5 = phase ch2 * 180 / pi
   ------------------------------------------------
   -- (6) нахождение комплексного числа по заданным
   --     полярным координатам
   -----------------------------------
   test6 = mkPolar (sqrt 2) (pi / 4.0)
   -------------------------------------------------
   -- (7) нахождение полярных координат по заданному
   --     комплексному числу
   -------------------------
   test7 = polar ch1
   ---------------------------------------------------
   -- (8) нахождение комплексного числа с модулем 1 по
   --     заданному аргументу этого числа
   --------------------------------------
   test8 = cis (pi / 12.0)
   ------------------------------------------------------
   -- (9) преобразование целого числа в комплексное число
   ------------------------------------------------------
   test9 = fromInteger 7
   ------------------------------------------------
   -- (10) вычисление  с у м м ы  комплексных чисел
   ------------------------------------------------
   test10 = ch1 + ch2 + ch3
   -----------------------------------------------------------
   -- (11) вычисление  с у м м ы  комплексного и вещественного
   --      числа
   ------------------------
   test11  = (ch1, ch1 + 1)
   test11' = ch1 + pi
   ------------------------------------------------------
   -- (12) вычисление  р а з н о с т и  комплексных чисел
   ------------------------------------------------------
   test12 = ch1 - ch2
   ------------------------------------------------------
   -- (13) вычисление  п р о и з в е д е н и я  комплекс-
   --      ных чисел
   ------------------
   test13 = ch1 * ch2
   ------------------------------------------------------
   -- (14) вычисление  ч а с т н о г о  комплексных чисел
   ------------------------------------------------------
   test14 = ch1 / ch2
   ---------------------------------------------------
   -- (15) возведение комплексного числа в комплексную
   --      с т е п е н ь
   -----------------------------------------------------------
   test15:: Complex Double -> Complex Double -> Complex Double 
   test15 x y = x ** y

   test15' = ch1 ** ch2
   ----------------------------------------------------------
   -- (16) извлечение квадратного корня из комплексного числа
   ----------------------------------------------------------
   test16  = sqrt ch2
   test16' = (ch0, sqrt ch0 ** 2)
   --------------------------------------------------------
   -- (17) извлечение корня n-степени из комплексного числа
   --------------------------------------------------------
   test17 x n = x ** (1.0 / n)

   -- ************************************************
   -- (18) вычисление значения комплексной функции exp
   ---------------------------------------------------
   test18 = exp ch2
   ---------------------------------------------------
   -- (19) вычисление значения комплексной функции log
   --      (натуральный логарифм)
   ------------------------------ 
   test19 = log ch2

   -- ************************************************
   -- (20) вычисление значения комплексной функции sin
   --      (с и н у с)
   -------------------
   test20 = sin ch2
   ---------------------------------------------------
   -- (21) вычисление значения комплексной функции cos
   --      (к о с и н у с)
   -----------------------
   test21 = cos ch2
   ---------------------------------------------------
   -- (22) вычисление значения комплексной функции tan
   --      (т а н г е н с)
   -----------------------
   test22 = tan ch2

   -- *************************************************
   -- (23) вычисление значения комплексной функции asin
   --      (а р к с и н у с)
   -------------------------
   test23  = asin ch2
   test23' = (ch1,asin (sin ch1))
   ----------------------------------------------------
   -- (24) вычисление значения комплексной функции acos
   --      (а р к к о с и н у с)
   -----------------------------
   test24 = acos ch2
   ----------------------------------------------------
   -- (25) вычисление значения комплексной функции atan
   --      (а р к т а н г е н с)
   -----------------------------
   test25 = atan ch2

   -- *************************************************
   -- (26) вычисление значения комплексной функции sinh
   --      (гиперболический синус)
   -------------------------------
   test26 = sinh ch2
   ----------------------------------------------------
   -- (27) вычисление значения комплексной функции cosh
   --      (гиперболический косинус)
   ---------------------------------
   test27 = cosh ch2
   ----------------------------------------------------
   -- (28) вычисление значения комплексной функции tanh
   --      (гиперболический тангенс)
   ---------------------------------
   test28  = tanh ch2

   -- **************************************************
   -- (29) вычисление значения комплексной функции asinh
   --      (гиперболический  а р е а с и н у с)
   --------------------------------------------
   test29  = asinh ch2
   -----------------------------------------------------
   -- (30) вычисление значения комплексной функции acosh
   --      (гиперболический  а р е а к о с и н у с)
   ------------------------------------------------
   test30  = acosh ch2
   -----------------------------------------------------
   -- (31) вычисление значения комплексной функции atanh
   --      (гиперболический  а р е а т а н г е н с)
   ------------------------------------------------
   test31  = atanh ch4

   -- ***********************
   -- Р е а л и з а ц и я ...
   -----------------------------------------------
   asin' z = -i * log (i * (z + sqrt (z * z - 1)))
        where i = 0 :+ (-1)
   acos' z = -i * log (z + sqrt (z * z - 1))
        where i = 0 :+ (-1)
   ---------------------------
   tanh'   z = sinh z / cosh z
   asinh'  z = log (z + sqrt (1 + z * z))
   acosh'  z = log (z + sqrt (z + 1) * sqrt (z - 1))
   atanh'  z = 0.5 * log ((1 + z) / (1 - z))
   atanh'' z = 0.5 * log (magnitude ((1 + z) / (1 - z))) 
                    :+ (0.5 * phase ((1 + z) / (1 - z)))

   -- ***************************
   -- Неудачные тестовые примеры:
   -------------------------------------------
   test32  = map (\z -> (z, (tanh . atanh) z))
                 [ch0,ch1,ch2,ch3,ch4]
   test32' = map (\z -> (z, (tanh' . atanh') z))
                 [ch0,ch1,ch2,ch3,ch4]

   -------------------------------
   -- Странные результаты (?!) ...
   -------------------------------------------
   test33  = map (\z -> (z, (atanh . tanh) z))
                 [ch0,ch1,ch2,ch3,ch4,ch5]
   ---------------------------------------------
   test33' = map (\z -> (z, (atanh' . tanh') z))
                 [ch0,ch1,ch2,ch3,ch4,ch5]

   ------------------------------------
   -- Коррекция получаемого результата:
   ------------------------------------
   res z = ((atanh . tanh) z) 
              + (0 :+ 1) * pi * fromInteger (abc z)
      where abc z = ceiling $ (2.0 * b - phi) / 2.0 / pi
                 where b   = imagPart z
                       phi = phase ((1 + z) / (1 - z))
   ---------------------------------------------------
   test34 = map (\z -> res z) 
                [3 :+ 4.45, 3 :+ 10.12, 3 :+ 108, 3 :+ 1111.56]
