   -- Демонстрации приближённого решения некоторых задач,
   -- относящихся к теории  ч и с л о в ы х  р я д о в
   -- ************************************************
   -- Вычисление n-ой частичной суммы ряда, n-й член
   -- которого задан функцией f
   ----------------------------------
   s n f = sum $ take n $ map f [1..]

   -- ********************************************
   -- Вычисление последовательности частичных сумм
   -- ряда, n-й член которого задан функцией f
   --------------------------------------------
   lim n f = scanl (+) 0 (take n $ map f [1..])

   -- ***********************************************
   -- Функция возвращает погрешность вычисления суммы
   -- числового ряда, n-й член которого задан функцией f
   -----------------------------------------------------
   err n f = last' (lim n f)
        where last' lst = abs (last lst - last (init lst))

   -- ***********************************************
   -- Функции для тестирования вычислений суммы рядов
   --------------------------------------------------
   prov  = pi * pi/6.0
   prov' = pi * pi * pi * pi / 90.0

   -- ***************************
   -- Неудачные тестовые примеры:
   ------------------------------
   f  = \x -> 1.0 / x^2
   f' = \x -> 1.0 / x^4
   f''= \x -> 1 / x
   ------------------------
   test1 = (s 1000 f, prov)
   test2 = (s 10000 f', prov')
   test3 = (s 100 f'', s 5000 f'', s 10000 f'', s 15000 f'')
   test4 = (err 10 f, err 50 f, err 5000 f)
